<a href="https://colab.research.google.com/github/brahmanarman01/Data_Science_Practice/blob/pandas/pandafoundation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Import the pandas library
import pandas as pd

In [3]:
# Create a pandas Series with default index
s1=pd.Series([2,3,4,5,6,7])
s1

0    2
1    3
2    4
3    5
4    6
5    7
dtype: int64

In [9]:
# Create a pandas Series with a custom index
s2=pd.Series([2215000342,2315000342,43245879,52895930,63563467,732564578,48956626], index=["Arman","polio","yashy","alok","tarun","shyam","himanshu"])
s2

Arman       2215000342
polio       2315000342
yashy         43245879
alok          52895930
tarun         63563467
shyam        732564578
himanshu      48956626
dtype: int64

In [10]:
s2["yashy"]

np.int64(43245879)

In [11]:
# Create a dictionary and convert it into a pandas DataFrame
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

df = pd.DataFrame(data)
print(df)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [12]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
# Display the column names of the DataFrame
df.columns

Index(['name', 'age', 'city'], dtype='object')